/********************************************************************************
 *  main2-1.c                                                                   *
 *  Το αρχείο αυτό προσομοιώνει τον ρόλο ενός υψηλότερου-επιπέδου αρθρώματος    *
 *  ενός ΣΔΒΔ το οποίο καλεί συναρτήσεις του επιπέδου που ασχολείται με  τον    *
 *  χειρισμό b+-δένδρων (ΒΔ). Η προσοχή του αρχείου επικεντρώνεται              *
 *  στην δημιουργία ΒΔ δένδρων και στην εισαγωγή και αναζήτηση εγγραφών         *
 ********************************************************************************/

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "defn.h"
#include "AM.h"

char empName[40];
char empAge[40];
char empSal[40];
char dnameAge[40];
int main() {
	int i,j,l,s;

	AM_Init();
	j=1212;
	printf("%d\n",AM_CreateIndex("kokos",'i',4,'c',255));
	i=AM_OpenIndex("kokos");
	printf("%d\n",AM_InsertEntry(i,j,"sss"));

}
